<html>

<head>
  <title>Тип 2ч</title>
</head>

<style>
  a {text-decoration: none;}
</style>

<body link='black' alink='black' vlink='black'>
  <ol>
    <li>
      <a href='lab1/task11.php'>
        С помощью оператора echo выведите на страницу: 
        <ol type='a'>
          <li>Целочисленную переменную 
          <li>Переменную дробного типа 
          <li>Переменную булевского типа 
          <li>Строковую переменную 
          <li>Константу
        </ol>
      </a>
    <li>
      <a href='lab1/task12.php'>
        Повторите вывод, заключив переменные в двойные кавычки (“). Посмотрите, что получится. Объясните результат.
      </a>
    <li>
      <a href='lab1/task13.php'>
        Повторите вывод, заключив переменные в одинарные кавычки (‘). Посмотрите, что получится. Объясните результат.
      </a>
    <li>
      <a href='lab1/task14.php'>
        Выведите на экран любое четверостишие.
        Для каждой новой строки используйте отдельный оператор echo. Каждая строчка должна быть отдельной строковой переменной. Также необходимо использовать переводы строки. После четверостишия поставьте инициалы автора и сделайте их подчёркнутыми.
      </a>
    <li>
      <a href='lab1/task15.php'>
        Выполните эти же действия, с помощью одного оператора echo.
      </a>
    <li>
      <a href='lab1/task16.php'>
        Попробуйте в выражении использовать разные типы данных, например, сложите число «10» и строку «20 приветов». Что получится? Объясните результат.
      </a>
    <li>
      <a href='lab1/task17.php'>
        Дайте ответ на вопрос, как работает оператор xor? В каких случаях он возвращает значение true, в каких – false? Для этого напишите скрипт, который выводит значения операций со всеми возможными вариантами операндов (4 варианта). Чему равно $a xor $a для любых значений $a?
      </a>
      <li>
      <a href='lab1/task18.php'>
        Дан фрагмент кода: &lt?php $x = 10; $y = 15;?&gt<br>
        Необходимо дописать несколько операций так, чтобы в итоге значения переменных поменялись местами. При этом, использовать другие переменные запрещается.
      </a>
      <ol>
</body>