<h3>
    1. Обязательно сделайте скрипты, приведенные в качестве примеров в этом уроке.  
</h3>
<ul>
    <li><a href="./galery/">Галерея изображений</a></li>
    <li><a href="./calculator/sum.php">Нахождение суммы чисел</a></li>
</ul>
<h3>
    2. Превратите получившийся сумматор в калькулятор с четырьмя операциями: сложение, вычитание, умножение, деление. Не забудьте обработать деление на ноль! Выбор операции можно осуществлять с помощью тега $ltselect>.
</h3>
<ul>
    <li><a href="./calculator/calc-select.php">Калькулятор с выбором операции через select</a></li>
</ul>
<h3>
    3. Создайте калькулятор, который будет определять тип выбранной пользователем операции, ориентируясь на нажатую кнопку.
</h3>
<ul>
    <li><a href="./calculator/calc-button.php">Калькулятор с выбором операции через button</a></li>
</ul>
<h3>
    4. Данные, введённые пользователем в поля, должны сохраняться и выводиться вместе с результатом вычисления. 
</h3>
<ul>
    <li><a href="./calculator/">Калькулятор (финальная версия)</a></li>
</ul>