<h3>
    1. Создайте главную страницу сайта index.php, которая будет неавторизованных пользователей отправлять на страницу авторизации, а авторизованных на ту страницу, которую они посещали последний раз ("А" или "Б"). Для пользователя не будет видно главной страницы, она нужна только для перенаправления.  
</h3>
<h3>
    2. Создайте три css файла с разными стилями. Затем сделайте страничку setting.php, на которой пользователь сможет выбрать себе один из вариантов оформления сайта. Информация о стиле сохраняется в куках и затем используется при показе страничек.
</h3>
<ul>
    <li><a href="./site/">Сайт с куками и сессией</a></li>
</ul>