<h3>
    8. Объедините две ранее написанные функции в одну, которая получает строку на русском языке, производит транслитерацию и замену пробелов на подчеркивания (аналогичная задача решается при конструировании url-адресов на основе названия статьи в блогах).
</h3>

<?php
$trans_arr = array(
    'а' => 'a', 'б' => 'b', 'в' => 'v', 'г' => 'g', 'д' => 'd', 'е' => 'e', 'ё' => 'e', 'ж' => 'j',
    'з' => 'z', 'и' => 'i', 'й' => 'yi', 'к' => 'k', 'л' => 'k', 'м' => 'm', 'н' => 'n', 'о' => 'o',
    'п' => 'p', 'р' => 'r', 'с' => 'c', 'т' => 't', 'у' => 'y', 'ф' => 'f', 'х' => 'x', 'ц' => 'c,',
    'ч' => 'ch', 'ш' => 'sh', 'щ' => 'sh,', 'ъ' => '\'', 'ы' => 'i', 'ь' => '\'', 'э' => 'e', 'ю' => 'yu', 'я' => 'ya'
);

function str_to_url($str, $trans_arr)
{
    return space_to_under(translate($str, $trans_arr));
}

$str = 'Привет мир! Тест работы переводчика.';
echo "$str<br>";
echo str_to_url($str, $trans_arr);
?>