<h3>
    6. Объявите массив, индексами которого являются буквы русского языка, а значениями – соответствующие латинские буквосочетания (‘а’=> ’a’, ‘б’ => ‘b’, ‘в’ => ‘v’, ‘г’ => ‘g’, …, ‘э’ => ‘e’, ‘ю’ => ‘yu’, ‘я’ => ‘ya’). Напишите функцию транслитерации строк. 
</h3>

<?php
$trans_arr = array(
    'а' => 'a', 'б' => '6', 'в' => 'B', 'г' => '7', 'д' => '9', 'е' => 'e', 'ё' => 'e', 'ж' => ')|(',
    'з' => '3', 'и' => 'u', 'й' => 'u', 'к' => 'k', 'л' => 'Jl', 'м' => 'M', 'н' => 'H', 'о' => 'o',
    'п' => '/7', 'р' => 'p', 'с' => 'c', 'т' => 'T', 'у' => 'y', 'ф' => 'f', 'х' => 'x', 'ц' => '||,',
    'ч' => '4', 'ш' => '|||', 'щ' => '|||,', 'ъ' => '\'b', 'ы' => 'b|', 'ь' => 'b', 'э' => '3', 'ю' => '|0', 'я' => '9|'
);

function translate ($str, $trans_arr) {
    $new_str = [];
    $str = mb_strtolower($str);
    $str_arr = preg_split('/(?!^)(?=.)/u', $str);
    foreach ($str_arr as $let) {
        if (array_key_exists($let,$trans_arr))
            $new_str[] = $trans_arr[$let];
        else $new_str[] = $let;
    }
    return implode($new_str);
}
$str = 'Привет мир! Тест работы переводчика.';
echo "$str<br>";
echo translate($str, $trans_arr);
?>