<h3>
    5. Повторите предыдущее задание, но выводите на экран только города, начинающиеся с буквы «К».
</h3>

<?php
$regions = array(
    "Минская область: " => array("Минск", "Логойск", "Борисов", "Молодечно", "Дзержинск", "Копыль"),
    "Брестская область: " => array("Брест", "Пружаны", "Каменец"),
    "Витебская область: " => array("Витебск", "Полоцк", "Орша"),
    "Гродненская область: " => array("Гродно", "Щучин", "Лида", "Кореличи"),
    "Гомельская область: " => array("Гомель", "Речица", "Жлобин"),
    "Могилевская область: " => array("Могилев", "Шклов", "Горки"),
);
foreach ($regions as $region => $cities) {
    echo "$region<br>&emsp;";
    $len = count($cities);
    foreach ($cities as $city) {
        $ch = mb_substr($city, 0, 1, "UTF-8");
        if ($ch == "К") echo "$city, ";
    }
    echo "<br>";
}
?>