<h3>
    После предыдущего урока Вы реализовали галерею изображений с помощью файлов и папок. Теперь необходимо сделать то же самое, но для хранения имен картинок следует использовать базу данных. 
    Создать галерею изображений, состоящую из двух страниц: <br>
    index.php – просмотр всех фотографий (уменьшенных копий);<br> 
    photo.php – просмотр конкретной фотографии (изображение оригинального размера). <br>
    В базе данных создать таблицу, в которой будет храниться информация о картинках. <br>
    На странице просмотра фотографии полного размера под картинкой должно быть указано число ее просмотров. <br>
    На странице просмотра галереи список фотографий должен быть отсортирован по популярности. Популярность - число кликов по фотографии. 
</h3>
<ul>
    <li><a href="./galery/">Галерея изображений</a></li>
</ul>